{
  "blogs": [
    {
      "title": "'Dog coronavirus found in humans’ – why you shouldn’t worry ",
      "content": "Scientists have found a new canine coronavirus in a handful of people hospitalised with pneumonia. This may sound alarming, but once we unpack it, you will see that there’s no reason to lose any sleep. The discovery of the canine coronavirus in eight people at a hospital in Sarawak, Malaysia, was reported in Clinical Infectious Diseases by a group of highly regarded international scientists. So does this mean dogs can spread coronaviruses to humans? The first thing to clarify is what canine coronavirus is. Importantly, it is quite distinct from SARS-CoV-2, the virus that causes COVID-19. The coronavirus family can be divided into four groups of viruses: alpha, beta, gamma and delta coronaviruses. SARS-CoV-2 falls within the betacoronaviruses group, whereas the canine coronaviruses are in the entirely separate alphacoronavirus group. Scientists have known about canine coronaviruses for almost 50 years. These viruses have existed in relative obscurity over most of this period, being of interest only to veterinary virologists and occasional dog owners. There are no previous reports of these viruses infecting people. But the sudden international spotlight on all coronaviruses is finding coronaviruses in places we haven’t looked before. ",
      "isPublished": true,
      "id": 1
    },
    {
      "title": "Is 150 years really the limit of human lifespan?",
      "content": "While most of us can expect to live to around 80, some people defy expectations and live to be over 100. In places such as Okinawa, Japan and Sardinia, Italy, there are many centenarians. The oldest person in history – a French woman named Jeanne Calment – lived to 122. When she was born in 1875, the average life expectancy was roughly 43. But just how long could a human actually live? It’s a question people have been asking for centuries. While average life expectancy (the number of years a person can expect to live) is relatively easy to calculate, maximum lifespan estimates (the greatest age a human could possibly reach) are much harder to make. Previous studies have placed this limit close to 140 years of age. But a more recent study proposes that the limit to human lifespan is closer to 150.",
      "isPublished": false,
      "id": 2
    },
    {
      "title": "Edward Colston museum display: what happens next for the fallen statue",
      "content": "When Black Lives Matter protests broke out in the summer of 2020, attention quickly turned to perceived symbols of oppression. After years of calls to remove racist monuments, Confederate and colonial statues quickly came down all over the world. But despite this, art historian Erin Thompson has found that many or most have gone up again in new locations. Some statues have been moved into museums; others have been moved to private locales owned by people who are most enthusiastic about preserving them. Few have been destroyed, and in many places, including the UK, new laws block removal of statues, prescribing instead that they should be retained and explained. Thompson argues that since permanent removal is rare, the question is less whether statues should be removed, and more where they should be located, and how they should be contextualised.",
      "isPublished": false,
      "id": 3
    },
    {
      "title": "Supersonic flights are set to return – here’s how they can succeed where Concorde failed",
      "content": "United Airlines has announced it will purchase up to 50 Boom Overture supersonic jets for commercial use by 2029, heralding the return of supersonic passenger flights nearly 20 years after the Concorde was decommissioned. Supersonic planes halve the time it takes to fly from New York to London, from seven hours down to 3.5 hours, but such airliners were abandoned following Concorde’s final flight in 2003. Concorde had become financially unworkable after a high-profile crash in 2000, combined with excessive ticket prices, high fuel consumption, and increasingly high maintenance costs.",
      "isPublished": true,
      "id": 4
    },
    {
      "title": "I’m a solar eclipse chaser – here’s what to expect from this week’s partial eclipse ",
      "content": "In December 2020, in the middle of a pandemic, I made the somewhat questionable decision to fly 11,200km from where I live in Belfast, Northern Ireland to Santiago, Chile. Then, I boarded a connecting two-hour flight and drove for a further two hours, just to experience two minutes and 20 seconds of darkness. I followed the guidelines of both the UK and Chilean governments. I got COVID-compliant travel insurance; I took a PCR test 72 hours before arriving in Chile; I wore a mask for the 15-hour flight and had my temperature taken in every building I entered. I also risked getting stranded on the other side of the world the week before Christmas, as the UK was considering banning domestic flights from England to Northern Ireland. ",
      "isPublished": true,
      "id": 5
    },
    {
      "title": "Four ways to enjoy a solar eclipse",
      "content": "The kind of solar eclipses usually portrayed in films are total solar eclipses – a reasonably rare event. They’re likely what you think about when you hear the word eclipse. A total eclipse is when the Moon and the Sun line up in the sky in such a way that the Moon blocks the entire face of the Sun – called totality. Somewhere on the Earth these occur approximately every 18 months. But we can’t all experience totality every time as the shadow of the Moon tracks a narrow path over the surface of the Earth. Any given point on the Earth is only likely to experience this approximately once every 375 years.",
      "isPublished": false,
      "id": 6
    }
  ]
}